pmo-dataset/variations/graphviz_with_ids/46.dot
digraph G {
  rankdir=LR;  
  node [shape=box];

  "Service_1" [label="Read order"];
  "Service_2" [label="Check if product is\nin stock"];
  "Service_3" [label="Reorder from\nwholesaler"];
  "Service_4" [label="Waiting until\narrives (handling\nsystem)"];
  "Service_5" [label="Demand delivery\ndelay penalty from\nthe wholesaler"];
  "Manual_1" [label="Withdraw the Product\nfrom warehouse"];
  "Manual_2" [label="Register in stock\nmanagement system"];
  "Manual_3" [label="Check if the whole\norder is ready for\nshipment"];
  "Manual_4" [label="Packing the products"];
  "Manual_5" [label="Shipping the order"];
  "Manual_6" [label="Courier is requested"];
  "StartNoneEvent_1" [shape=circle, label="Storage management"];
  "EndNoneEvent_1" [shape=circle, penwidth=4, label="Order was shipped"];
  "ExclusiveGateway_1" [shape=diamond, label="Is in stock?"];
  "ExclusiveGateway_2" [shape=diamond, label="Arrived after more\nthan ten days?"];
  "ExclusiveGateway_3" [shape=diamond, label="Order is ready for\nshipment?"];
  "ExclusiveGateway_4" [shape=diamond, label="X"];
  "ExclusiveGateway_5" [shape=diamond, label="X"];
  "ParallelGateway_1" [shape=diamond, label="+"];
  "ParallelGateway_2" [shape=diamond, label="+"];

  "StartNoneEvent_1" -> "Service_1";
  "Service_1" -> "ExclusiveGateway_5";
  "Service_2" -> "ExclusiveGateway_1";
  "ExclusiveGateway_1" -> "Manual_1" [label="Yes"];
  "ExclusiveGateway_1" -> "Service_3" [label="No"];
  "Service_3" -> "Service_4";
  "Service_4" -> "ExclusiveGateway_2";
  "Service_5" -> "ExclusiveGateway_4";
  "ExclusiveGateway_2" -> "Service_5" [label="Yes"];
  "Manual_1" -> "Manual_3";
  "Manual_2" -> "Manual_3";
  "Manual_3" -> "ExclusiveGateway_3";
  "Manual_5" -> "EndNoneEvent_1";
  "ExclusiveGateway_4" -> "Manual_2";
  "ExclusiveGateway_5" -> "Service_2";
  "ExclusiveGateway_3" -> "ExclusiveGateway_5" [label="No"];
  "ExclusiveGateway_2" -> "ExclusiveGateway_4" [label="No"];
  "ParallelGateway_2" -> "Manual_5";
  "ParallelGateway_1" -> "Manual_6";
  "ExclusiveGateway_3" -> "ParallelGateway_1" [label="Yes"];
  "Manual_4" -> "ParallelGateway_2";
  "Manual_6" -> "ParallelGateway_2";
  "ParallelGateway_1" -> "Manual_4";
}
